package crm.data
import crm.models.*

object MockData {
    val clients = listOf(
        Client(1, "Иван Петров", "ООО Альфа", "+7 912 345-67-89", "ivan@alfa.ru", "Активный", "Булат"),
        Client(2, "Анна Смирнова", "ИП Смирнова", "+7 987 654-32-10", "anna@mail.ru", "Лид", "Егор"),
        Client(3, "Дмитрий Козлов", "TechSoft", "+7 900 111-22-33", "dk@techsoft.ru", "Активный", "Ярик")
    )

    val deals = listOf(
        Deal(1, "ООО Ромашка", 120_000, "Иван Петров", "Новый лид", "12.09.2026"),
        Deal(2, "ИП Сидоров", 80_000, "Алексей Сидоров", "Новый лид", "11.09.2026"),
        Deal(3, "ООО Техно", 220_000, "Дмитрий Козлов", "Новый лид", "10.09.2026"),
        Deal(4, "ИП Петров", 150_000, "Петр Петров", "Контакт установлен", "10.09.2026"),
        Deal(5, "ООО Вектор", 130_000, "Анна Смирнова", "Контакт установлен", "09.09.2026"),
        Deal(6, "TechSoft", 240_000, "Дмитрий Козлов", "Переговоры", "12.09.2026"),
        Deal(8, "ООО Альфа", 120_000, "Иван Петров", "Договор", "10.09.2026"),
        Deal(9, "ООО Гамма", 240_000, "Мария Кузнецова", "Успех", "08.09.2026")
    )
}
